.doom.d/config.el
(setq user-full-name "Simon Christensen"
      user-mail-address "c3lphie@protonmail")

(setq doom-font (font-spec :family "monospace" :size 15))

(setq doom-theme 'doom-dracula)

(setq display-line-numbers-type t)

(set-frame-parameter (selected-frame) 'alpha '(100 .85))

(setq org-startup-with-inline-images t)

(setq org-directory "~/repositories/notes/")
